**SQL JOINS CONT...**

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite:///sales.db

In [ ]:
%%sql CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(255),
    ContactName VARCHAR(255),
    Address VARCHAR(255),
    City VARCHAR(255),
    PostalCode VARCHAR(20),
    Country VARCHAR(255)
);

 * sqlite:///sales.db
Done.

[]

In [ ]:
%%sql INSERT INTO Customers (CustomerID, CustomerName, ContactName, Address, City, PostalCode, Country) VALUES
(1, 'John Doe', 'John', '123 Main St', 'Nairobi', '12345', 'Kenya'),
(2, 'Jane Smith', 'Jane', '456 Oak St', 'Mombasa', '67890', 'Kenya'),
(3, 'Alice Johnson', 'Alice', '789 Pine St', 'Kisumu', '54321', 'Kenya'),
(4, 'Robert Williams', 'Robert', '101 Cedar St', 'Nakuru', '98765', 'Kenya'),
(5, 'Eva Brown', 'Eva', '202 Maple St', 'Eldoret', '24680', 'Kenya'),
(6, 'David Wilson', 'David', '303 Birch St', 'Thika', '13579', 'Kenya'),
(7, 'Grace Taylor', 'Grace', '404 Redwood St', 'Kakamega', '86420', 'Kenya'),
(8, 'Michael Davis', 'Michael', '505 Elm St', 'Machakos', '97531', 'Kenya'),
(9, 'Sophia Martinez', 'Sophia', '606 Pineapple St', 'Kericho', '10432', 'Kenya'),
(10, 'Daniel Moore', 'Daniel', '707 Cedar St', 'Kisii', '68374', 'Kenya'),
(11, 'Olivia Johnson', 'Olivia', '808 Oak St', 'Nyeri', '29574', 'Kenya'),
(12, 'William Garcia', 'William', '909 Maple St', 'Malindi', '72948', 'Kenya'),
(13, 'Emma Rodriguez', 'Emma', '1011 Pine St', 'Lamu', '47382', 'Kenya'),
(14, 'Henry Lee', 'Henry', '1212 Cedar St', 'Voi', '62718', 'Kenya'),
(15, 'Sophie Kimani', 'Sophie', '1313 Acacia St', 'Kitui', '81937', 'Kenya');

 * sqlite:///sales.db
15 rows affected.

[]

In [ ]:
%%sql CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE,
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

 * sqlite:///sales.db
Done.

[]

In [ ]:
%%sql INSERT INTO Orders VALUES
(101, 1, '2024-01-10'),
(102, 15, '2024-02-15'),
(103, 3, '2024-03-20'),
(104, 12, '2024-04-25'),
(105, 4, '2024-05-30'),
(106, 15, '2024-06-05'),
(107, 2, '2024-07-10'),
(108, 11, '2024-08-15'),
(109, 3, '2024-09-20'),
(110, 6, '2024-10-25'),
(111, 5, '2024-11-30'),
(112, 9, '2024-12-05'),
(113, 2, '2025-01-10'),
(114, 3, '2025-02-15'),
(115, 4, '2025-03-20'),
(116, 5, '2025-04-25'),
(117, 1, '2025-05-30'),
(118, 8, '2025-06-05'),
(119, 3, '2025-07-10'),
(120, 4, '2025-08-15');

 * sqlite:///sales.db
20 rows affected.

[]

In [ ]:
%%sql CREATE TABLE OrderDetails (
    OrderDetailID INT PRIMARY KEY,
    OrderID INT,
    ProductID INT,
    Quantity INT,
    Sales DECIMAL(10, 2),
    FOREIGN KEY (OrderID) REFERENCES Orders(OrderID),
    FOREIGN KEY (ProductID) REFERENCES Products(ProductID)
);

 * sqlite:///sales.db
Done.

[]

In [ ]:
%%sql INSERT INTO OrderDetails VALUES
(1, 101, 1, 5, 100.00),
(2, 102, 2, 10, 200.00),
(3, 103, 3, 8, 160.00),
(4, 104, 4, 12, 240.00),
(5, 105, 5, 15, 300.00),
(6, 106, 6, 20, 400.00),
(7, 107, 7, 25, 500.00),
(8, 108, 8, 30, 600.00),
(9, 109, 9, 5, 100.00),
(10, 110, 10, 10, 200.00),
(11, 111, 11, 15, 300.00),
(12, 112, 12, 8, 160.00),
(13, 113, 13, 6, 120.00),
(14, 114, 14, 10, 200.00),
(15, 115, 15, 20, 400.00),
(16, 116, 1, 25, 500.00),
(17, 117, 2, 30, 600.00),
(18, 118, 3, 15, 300.00),
(19, 119, 4, 10, 200.00),
(20, 120, 5, 12, 240.00);

 * sqlite:///sales.db
20 rows affected.

[]

# **QUERIES:**

**Question: Show all customers and their orders, including those who haven't placed any orders.**

In [ ]:
%sql SELECT * FROM Customers LIMIT 3;

 * sqlite:///sales.db
Done.

[(1, 'John Doe', 'John', '123 Main St', 'Nairobi', '12345', 'Kenya'),
 (2, 'Jane Smith', 'Jane', '456 Oak St', 'Mombasa', '67890', 'Kenya'),
 (3, 'Alice Johnson', 'Alice', '789 Pine St', 'Kisumu', '54321', 'Kenya')]

In [ ]:
%sql SELECT * FROM Orders LIMIT 3;

 * sqlite:///sales.db
Done.

[(101, 1, '2024-01-10'), (102, 15, '2024-02-15'), (103, 3, '2024-03-20')]

In [ ]:
%sql SELECT * FROM OrderDetails LIMIT 3;

 * sqlite:///sales.db
Done.

[(1, 101, 1, 5, 100), (2, 102, 2, 10, 200), (3, 103, 3, 8, 160)]

In [ ]:
%%sql SELECT Customers.CustomerName, Orders.OrderID, Orders.OrderDate
FROM Customers
LEFT JOIN Orders ON Customers.CustomerID = Orders.CustomerID;

 * sqlite:///sales.db
Done.

[('John Doe', 101, '2024-01-10'),
 ('John Doe', 117, '2025-05-30'),
 ('Jane Smith', 107, '2024-07-10'),
 ('Jane Smith', 113, '2025-01-10'),
 ('Alice Johnson', 103, '2024-03-20'),
 ('Alice Johnson', 109, '2024-09-20'),
 ('Alice Johnson', 114, '2025-02-15'),
 ('Alice Johnson', 119, '2025-07-10'),
 ('Robert Williams', 105, '2024-05-30'),
 ('Robert Williams', 115, '2025-03-20'),
 ('Robert Williams', 120, '2025-08-15'),
 ('Eva Brown', 111, '2024-11-30'),
 ('Eva Brown', 116, '2025-04-25'),
 ('David Wilson', 110, '2024-10-25'),
 ('Grace Taylor', None, None),
 ('Michael Davis', 118, '2025-06-05'),
 ('Sophia Martinez', 112, '2024-12-05'),
 ('Daniel Moore', None, None),
 ('Olivia Johnson', 108, '2024-08-15'),
 ('William Garcia', 104, '2024-04-25'),
 ('Emma Rodriguez', None, None),
 ('Henry Lee', None, None),
 ('Sophie Kimani', 102, '2024-02-15'),
 ('Sophie Kimani', 106, '2024-06-05')]

**Question: Display all orders and their corresponding customers, even if the customer information is missing.**

In [ ]:
%%sql SELECT Customers.CustomerName, Orders.OrderID, Orders.OrderDate, OrderDetails.Sales
FROM Orders
RIGHT JOIN Customers ON Orders.CustomerID = Customers.CustomerID;

 * sqlite:///sales.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT Customers.CustomerName, Orders.OrderID, Orders.OrderDate, OrderDetails.Sales
FROM Orders
RIGHT JOIN Customers ON Orders.CustomerID = Customers.CustomerID;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

**Question: Retrieve the customer name, order date, and sales amount for all orders where customers have placed orders.**

In [ ]:
%sql select * from Customers limit 3;

 * sqlite:///sales.db
Done.

[(1, 'John Doe', 'John', '123 Main St', 'Nairobi', '12345', 'Kenya'),
 (2, 'Jane Smith', 'Jane', '456 Oak St', 'Mombasa', '67890', 'Kenya'),
 (3, 'Alice Johnson', 'Alice', '789 Pine St', 'Kisumu', '54321', 'Kenya')]

In [ ]:
%sql select * from Orders limit 3;

 * sqlite:///sales.db
Done.

[(101, 1, '2024-01-10'), (102, 15, '2024-02-15'), (103, 3, '2024-03-20')]

In [ ]:
%sql select * from OrderDetails limit 3;

 * sqlite:///sales.db
Done.

[(1, 101, 1, 5, 100), (2, 102, 2, 10, 200), (3, 103, 3, 8, 160)]

In [ ]:
%%sql SELECT Customers.CustomerName,Orders.OrderDate,OrderDetails.Sales
from Customers
inner join Orders
on Customers.CustomerID = Orders.CustomerID
inner join OrderDetails
on Orders.OrderID = OrderDetails.OrderID;

 * sqlite:///sales.db
Done.

[('John Doe', '2024-01-10', 100),
 ('Sophie Kimani', '2024-02-15', 200),
 ('Alice Johnson', '2024-03-20', 160),
 ('William Garcia', '2024-04-25', 240),
 ('Robert Williams', '2024-05-30', 300),
 ('Sophie Kimani', '2024-06-05', 400),
 ('Jane Smith', '2024-07-10', 500),
 ('Olivia Johnson', '2024-08-15', 600),
 ('Alice Johnson', '2024-09-20', 100),
 ('David Wilson', '2024-10-25', 200),
 ('Eva Brown', '2024-11-30', 300),
 ('Sophia Martinez', '2024-12-05', 160),
 ('Jane Smith', '2025-01-10', 120),
 ('Alice Johnson', '2025-02-15', 200),
 ('Robert Williams', '2025-03-20', 400),
 ('Eva Brown', '2025-04-25', 500),
 ('John Doe', '2025-05-30', 600),
 ('Michael Davis', '2025-06-05', 300),
 ('Alice Johnson', '2025-07-10', 200),
 ('Robert Williams', '2025-08-15', 240)]

# **More sql operations**

**IN keyword**
From multiple things

In [ ]:
%sql SELECT * FROM CUSTOMERS LIMIT 3;

 * sqlite:///sales.db
Done.

[(1, 'John Doe', 'John', '123 Main St', 'Nairobi', '12345', 'Kenya'),
 (2, 'Jane Smith', 'Jane', '456 Oak St', 'Mombasa', '67890', 'Kenya'),
 (3, 'Alice Johnson', 'Alice', '789 Pine St', 'Kisumu', '54321', 'Kenya')]

In [ ]:
%%sql SELECT * FROM CUSTOMERS
WHERE City = 'Kisumu';

 * sqlite:///sales.db
Done.

[(3, 'Alice Johnson', 'Alice', '789 Pine St', 'Kisumu', '54321', 'Kenya')]

In [ ]:
%%sql SELECT * FROM Customers
WHERE City IN ('Nairobi','Kisumu','Mombasa');

 * sqlite:///sales.db
Done.

[(1, 'John Doe', 'John', '123 Main St', 'Nairobi', '12345', 'Kenya'),
 (2, 'Jane Smith', 'Jane', '456 Oak St', 'Mombasa', '67890', 'Kenya'),
 (3, 'Alice Johnson', 'Alice', '789 Pine St', 'Kisumu', '54321', 'Kenya')]

**Symbols; >, <, <>, BETWEEN**

In [ ]:
%sql select * from OrderDetails limit 3;

 * sqlite:///sales.db
Done.

[(1, 101, 1, 5, 100), (2, 102, 2, 10, 200), (3, 103, 3, 8, 160)]

In [ ]:
%%sql SELECT * FROM OrderDetails
WHERE Sales >= 200;

 * sqlite:///sales.db
Done.

[(2, 102, 2, 10, 200),
 (4, 104, 4, 12, 240),
 (5, 105, 5, 15, 300),
 (6, 106, 6, 20, 400),
 (7, 107, 7, 25, 500),
 (8, 108, 8, 30, 600),
 (10, 110, 10, 10, 200),
 (11, 111, 11, 15, 300),
 (14, 114, 14, 10, 200),
 (15, 115, 15, 20, 400),
 (16, 116, 1, 25, 500),
 (17, 117, 2, 30, 600),
 (18, 118, 3, 15, 300),
 (19, 119, 4, 10, 200),
 (20, 120, 5, 12, 240)]

In [ ]:
%%sql SELECT * FROM OrderDetails
WHERE Sales <= 200;

 * sqlite:///sales.db
Done.

[(1, 101, 1, 5, 100),
 (2, 102, 2, 10, 200),
 (3, 103, 3, 8, 160),
 (9, 109, 9, 5, 100),
 (10, 110, 10, 10, 200),
 (12, 112, 12, 8, 160),
 (13, 113, 13, 6, 120),
 (14, 114, 14, 10, 200),
 (19, 119, 4, 10, 200)]

In [ ]:
%%sql SELECT * FROM OrderDetails
WHERE Sales <> 200;

 * sqlite:///sales.db
Done.

[(1, 101, 1, 5, 100),
 (3, 103, 3, 8, 160),
 (4, 104, 4, 12, 240),
 (5, 105, 5, 15, 300),
 (6, 106, 6, 20, 400),
 (7, 107, 7, 25, 500),
 (8, 108, 8, 30, 600),
 (9, 109, 9, 5, 100),
 (11, 111, 11, 15, 300),
 (12, 112, 12, 8, 160),
 (13, 113, 13, 6, 120),
 (15, 115, 15, 20, 400),
 (16, 116, 1, 25, 500),
 (17, 117, 2, 30, 600),
 (18, 118, 3, 15, 300),
 (20, 120, 5, 12, 240)]

In [ ]:
%%sql SELECT * FROM OrderDetails
WHERE Sales BETWEEN 200 AND 300;

 * sqlite:///sales.db
Done.

[(2, 102, 2, 10, 200),
 (4, 104, 4, 12, 240),
 (5, 105, 5, 15, 300),
 (10, 110, 10, 10, 200),
 (11, 111, 11, 15, 300),
 (14, 114, 14, 10, 200),
 (18, 118, 3, 15, 300),
 (19, 119, 4, 10, 200),
 (20, 120, 5, 12, 240)]

**LIKE**

In [ ]:
%sql SELECT * FROM Customers LIMIT 5;

 * sqlite:///sales.db
Done.

[(1, 'John Doe', 'John', '123 Main St', 'Nairobi', '12345', 'Kenya'),
 (2, 'Jane Smith', 'Jane', '456 Oak St', 'Mombasa', '67890', 'Kenya'),
 (3, 'Alice Johnson', 'Alice', '789 Pine St', 'Kisumu', '54321', 'Kenya'),
 (4, 'Robert Williams', 'Robert', '101 Cedar St', 'Nakuru', '98765', 'Kenya'),
 (5, 'Eva Brown', 'Eva', '202 Maple St', 'Eldoret', '24680', 'Kenya')]

In [ ]:
# Rows whose names start with J

In [ ]:
%%sql SELECT * FROM CUSTOMERS
WHERE CustomerName LIKE 'A%';

 * sqlite:///sales.db
Done.

[(3, 'Alice Johnson', 'Alice', '789 Pine St', 'Kisumu', '54321', 'Kenya')]

In [ ]:
%%sql SELECT * FROM CUSTOMERS
WHERE CustomerName LIKE '%oo%';

 * sqlite:///sales.db
Done.

[(10, 'Daniel Moore', 'Daniel', '707 Cedar St', 'Kisii', '68374', 'Kenya')]